Revit 2027 API
AnalyticalAutomationFailures Properties
The BuiltInFailures.AnalyticalAutomationFailures type exposes the following members.
Properties
Name | Description
DeleteGeneratedPlans |  You are about to change your selection. Updating your selection will delete the existing reference plans.
EmptySelection |  There are no selected elements.
LevelsHiddenInViewWarning |  Some levels are hidden. The alignment plans will also consider the hidden levels.
Top
See Also
Reference
BuiltInFailures.AnalyticalAutomationFailures Class
Autodesk.Revit.DB Namespace